# Источник: kompege.ru
# id задачи: 25400

# Итак, в 16 номере нужно посчитать значение рекурсивной функции,
# чаще всего попадаются 1 или 2 функции
# далее нам нужно закэшировать значеие(-я) фцнкции(-й)
# в кэшировании важно анализировать содержимое функции(-й),
# чтобы верно всё сделать, а иначе будет ошибка

# в данном примере рассмотрим 2 функции
# Импорт кэша, куда мы будем кэшировать значения функции
from functools import lru_cache

# далаем аннотацию 'lru_cache'
# подробнее об этой аннотации стоит прочитать в документации питона https://docs.python.org/

@lru_cache(maxsize=None)
def f(n: int) -> int:
    if n < 31054:
        return f(n + 4) + 3020

    return 3 * (g(n - 2) - 15)


@lru_cache(maxsize=None)
def g(n: int) -> int:
    if n >= 28:
        return g(n - 5) - 15

    return 3 * n - 4

# Далее мы кэшируем данные
# В данном случае тут все функции кэшируются
# поэтому мы берём ту, которая зависит только от себя же
# Берём с небольшим запасом
for i in range(60_000):
    g(i)

for i in range(55_000, 0, -1):
    f(i)

# Выводим ответ
print(f(15))
