# Источник: kompege.ru
# id задачи: 28937

# Итак, в 16 номере нужно посчитать значение рекурсивной функции,
# чаще всего попадаются 1 или 2 функции
# далее нам нужно закэшировать значеие(-я) фцнкции(-й)
# в кэшировании важно анализировать содержимое функции(-й),
# чтобы верно всё сделать, а иначе будет ошибка

# в данном примере рассмотрим 2 функции
# Импорт кэша, куда мы будем кэшировать значения функции
from functools import lru_cache

# далаем аннотацию 'lru_cache'
# подробнее об этой аннотации стоит прочитать в документации питона https://docs.python.org/
@lru_cache(maxsize=None)
def f(n: int) -> int:
    if n >= 21:
        return f(n - 8) + 1095

    return 10 * (g(n - 7) - 36)


@lru_cache(maxsize=None)
def g(n: int) -> int:
    if n >= 22560:
        return n/23 + 33

    return g(n + 11) - 4

# Далее мы кэшируем данные
# В данном случае тут все функции кэшируются
# поэтому мы берём ту, которая зависит только от себя же
# Берём с небольшим запасом
for i in range(22570, 0, -1):
    g(i)
for i in range(550):
    f(i)

# Выводим ответ
print(f(548))
