# Источник: kompege.ru
# id задачи: 29970

# Итак, в 16 номере нужно посчитать значение рекурсивной функции,
# чаще всего попадаются 1 или 2 функции
# далее нам нужно закэшировать значеие(-я) фцнкции(-й)
# в кэшировании важно анализировать содержимое функции(-й),
# чтобы верно всё сделать, а иначе будет ошибка

# в данном примере рассмотрим 2 функции
# Импорт кэша, куда мы будем кэшировать значения функции
from functools import lru_cache

# тут не нужен кэш так как f полностью зависит от g
def f(n: int) -> int:
    return 3 * g(n - 3) + 7

# далаем аннотацию 'lru_cache'
# подробнее об этой аннотации стоит прочитать в документации питона https://docs.python.org/
@lru_cache(maxsize=None)
def g(n: int) -> int:
    if n <= 20:
        return n + 2

    return g(n - 3) + 1

# Далее мы кэшируем данные
# В данном случае, когда n <= 20, то рекурсии нет
# Поэтому нам стоит начать кэширование с 0
# Так как с болшим значанием n функция будет уходить в более длиную рекурсию
# Поэтому нам в задачи нужно найти макимальный аргумент n
# В данном случае это 37811
# Берём с небольшим запасом
for i in range(37820):
    g(i)
# Выводим ответ
print(f(37811))

