# Пример для задачи КЕГЭ-31507
#
# Даны адрес узла 192.168.159.86 и маска 255.255.252.0. Найдите адрес сети. В ответе
# укажите сумму числовых значений октетов найденного IP-адреса.

import ipaddress

# Функция ipaddress.ip_network позволяет быстро создать IPv4Network при помощи строки
# формата "<адрес сети>/<маска подсети>".
#
# Обратите внимание: по умолчанию, если заданный IP-адрес является адресом узла
# (хоста), а не сети (то есть заданный адрес имеет ненулевые биты, которые отвечают за
# номер хоста), то эта функция выведет ошибку ValueError: <адрес> has host bits set.
#
# Чтобы обойти это ограничение, используйте параметр strict=False. В этом случае
# функция автоматически переконвертирует адрес узла в адрес сети согласно заданной
# маске подсети.

# Ошибка:
# network = ipaddress.ip_network("192.168.159.86/255.255.252.0")

# Всё ок:
network = ipaddress.ip_network("192.168.159.86/255.255.252.0", strict=False)

# В объектах класса IPv4Network аттрибут network_address хранит адрес сети
print(network.network_address)  # -> "192.168.156.0"

# Нужно найти сумму числовых значений октетов найденного IP-адреса:
# Ответ: 192 + 168 + 156 + 0 = 516
