# Пример для задачи КЕГЭ-31359
#
# Сеть задана IP-адресом одного из входящих в неё узлов 154.141.198.190 и сетевой
# маской 255.255.192.0. Найдите её широковещательный IP-адрес. В ответе укажите сумму
# числовых значений октетов найденного IP-адреса.

import ipaddress

# Функция ipaddress.ip_network позволяет быстро создать IPv4Network при помощи строки
# формата "<адрес сети>/<маска подсети>".
#
# Обратите внимание: по умолчанию, если заданный IP-адрес является адресом узла
# (хоста), а не сети (то есть заданный адрес имеет ненулевые биты, которые отвечают за
# номер хоста), то эта функция выведет ошибку ValueError: <адрес> has host bits set.
#
# Чтобы обойти это ограничение, используйте параметр strict=False. В этом случае
# функция автоматически переконвертирует адрес узла в адрес сети согласно заданной
# маске подсети.

# Ошибка:
# network = ipaddress.ip_network("154.141.198.190/255.255.192.0")

# Всё ок:
network = ipaddress.ip_network("154.141.198.190/255.255.192.0", strict=False)

# В объектах класса IPv4Network аттрибут broadcast_address хранит широковещательный
# адрес сети
print(network.broadcast_address)  # -> "154.141.255.255"

# Нужно найти сумму числовых значений октетов найденного IP-адреса:
# Ответ: 154 + 141 + 255 + 255 = 805
