# Пример для задачи КЕГЭ-29966
#
# Сеть задана IP-адресом одного из входящих в неё узлов 146.180.173.153 и сетевой
# маской 255.192.0.0. Найдите наибольший в данной сети IP-адрес, который может быть
# назначен компьютеру. В ответе укажите найденный IP-адрес без разделителей.

import ipaddress

# Функция ipaddress.ip_network позволяет быстро создать IPv4Network при помощи строки
# формата "<адрес сети>/<маска подсети>".
#
# Обратите внимание: по умолчанию, если заданный IP-адрес является адресом узла
# (хоста), а не сети (то есть заданный адрес имеет ненулевые биты, которые отвечают за
# номер хоста), то эта функция выведет ошибку ValueError: <адрес> has host bits set.
#
# Чтобы обойти это ограничение, используйте параметр strict=False. В этом случае
# функция автоматически переконвертирует адрес узла в адрес сети согласно заданной
# маске подсети.

# Ошибка:
# network = ipaddress.ip_network("146.180.173.153/255.192.0.0")

# Всё ок:
network = ipaddress.ip_network("146.180.173.153/255.192.0.0", strict=False)

# Объекты IPv4Network являются subscriptable, что означает что из них можно доставать
# элементы (в данном случае -- адреса узлов, принадлежащие этой сети) по индексу, точно
# так же, как это можно делать с list и tuple.
#
# Чтобы найди наибольший IP-адрес в сети, который можно назначить компьютеру, нужно
# достать из сети *ПРЕДПОСЛЕДНИЙ* адрес.
#
# Почему не последний? Потому что на последнем месте находится широковещательный адрес
# сети, а он компьютеру назначен быть не может.

max_host_address = network[-2]
print(max_host_address)  # -> "146.191.255.254"

# Ответ: 146191255254
