# Источник: kompege.ru
# id задачи: 31513

# Итак, в 16 номере нужно посчитать значение рекурсивной функции,
# чаще всего попадаются 1 или 2 функции
# далее нам нужно закэшировать значеие(-я) фцнкции(-й)
# в кэшировании важно анализировать содержимое функции(-й),
# чтобы верно всё сделать, а иначе будет ошибка

# в данном примере рассмотрим 1 функцию
# Импорт кэша, куда мы будем кэшировать значения функции
from functools import lru_cache

# далаем аннотацию 'lru_cache'
# подробнее об этой аннотации стоит прочитать в документации питона https://docs.python.org/
@lru_cache(maxsize=None)
def f(n: int) -> int:
    if n == 1:
        return 1
    return n * f(n - 1)

# Далее мы кэшируем данные
# В данном случае, когда n = 1, то рекурсии нет
# Поэтому нам стоит начать кэширование именно с 1
# Так как с болшим значанием n функция будет уходить в более длиную рекурсию
# Поэтому нам в задачи нужно найти макимальный аргумент n
# В данном случае это 3038
# Берём с небольшим запасом
for i in range(1, 3040):
    f(i)
# Выводим ответ
print((f(3038) + 5 * f(3037)) / f(3036))
