# Источник: kompege.ru
# id задачи: 27076

# Итак, в 16 номере нужно посчитать значение рекурсивной функции,
# чаще всего попадаются 1 или 2 функции
# далее нам нужно закэшировать значеие(-я) фцнкции(-й)
# в кэшировании важно анализировать содержимое функции(-й),
# чтобы верно всё сделать, а иначе будет ошибка

# в данном примере рассмотрим 3 функции
# Импорт кэша, куда мы будем кэшировать значения функции
from functools import lru_cache

# далаем аннотацию 'lru_cache'
# подробнее об этой аннотации стоит прочитать в документации питона https://docs
@lru_cache(maxsize=None)
def f(n: int) -> int:
    if n < 43:
        return g(n + 4)
    
    return 2 * f(n - 2) - f(n - 4) + 2


@lru_cache(maxsize=None)
def g(n: int) -> int:
    if n < 11240:
        return g(n + 3) + 2

    return q(n)


@lru_cache(maxsize=None)
def q(n: int) -> int:
    if n < 21:
        return n - 4

    return q(n - 4) + 2

# Далее мы кэшируем данные
# В данном случае тут все функции кэшируются
# поэтому мы берём ту, которая зависит только от себя же
# Берём с небольшим запасом
for i in range(15_000):
    q(i)

for i in range(15_000, 0, -1):
    g(i)

for i in range(2030):
    f(i)

# Выводим ответ
print(f(2026))
