# Если вам нужно найти значение А,
# то этот шаблон для вас
# В задаче могут быть дополнительные функции,
# такие как ДЕЛ(n, m) или может быть дан промежуток,
# наприер B = [30, 65]
# тогда мы пишем 30 <= n <= 65
def in_b(n: int) -> bool:
    return True

# эту функцию можно просто переписать, если она есть в задаче
def is_div(n: int, m: int) -> bool:
    return (n % m) == 0


# Главная функция, это логическое выражение из задачи
# Пример представлен ниже
def f(x: int, a: int) -> bool:
    return True
    # return is_div(x, a) or (in_b(x) <= (not(is_div(x, 22))))

# И наконец нам нужно найти миниальное или максимальное А,
# Для минимального нам нужно написать 'for a in range(1000)'
# Для максимального 'for a in range(1000, 0, -1)'
for a in range(1000, 0, -1):
    #Далее нам нужно найти такое А, чтобы ПРИ ЛЮБЫХ x
    # логическое выражение всегда принимало 1 или 0
    # Для 1 это: 'if all(f(x, a) for x in range(500))'
    # Для 0 это: 'if not any(f(x, a) for x in range(500))'
    if all(f(x, a) for x in range(500)):
        # Выводим ответ
        print(a)
        break
