# Если вам нужно найти значение А,
# чтобы при любых x y оно принимало 0 или 1,
# то этот шаблон для вас

# Главная функция, это логическое выражение из задачи
# Пример представлен ниже
def f(x: int, y: int, a: int) -> bool:
    return True
    # return ((x + y) <= 27) or (y <= (x - 1)) or (y >= a)

# И наконец нам нужно найти миниальное или максимальное А,
# Для минимального нам нужно написать 'for a in range(1000)'
# Для максимального 'for a in range(1000, 0, -1)'
for a in range(1000, 0, -1):
    #Далее нам нужно найти такое А, чтобы ПРИ ЛЮБЫХ x и y
    # логическое выражение всегда принимало 1 или 0
    # Для 1 это: 'if all(f(x, y, a) for x in range(500) for y in range(500))'
    # Для 0 это: 'if not any(f(x, y, a) for x in range(500) for y in range(500))'
    if all(f(x, y, a) for x in range(500) for y in range(500)):
        print(a)
        break
