# 'Если у вас условие задачи звучит так: Определите количество цифр с \
# чётным числовым значением в ... записи числа, заданного выражением...'
# то вам нужен этоот шаблон.
# Обычно в задачи указывается система счисления и выражение
BASE = 36
expression = 5 * (1296 ** 2021) - 4 * (216**2022) + 3 * (36 ** 2023) \
             - 2 * (6 ** 2024) - 2025
# Нм нужно вывести количество цифр
count = 0
while expression:
    # Далее пишем условие
    # В данном случае нам нужно просто вывести все чётные цифры
    remainder = expression % BASE
    if not(remainder & 1):
        count += 1
    expression //= BASE

# Выводим ответ
print(count)
